fio/results/fio-res_201904222200
Seq-Read-1m: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq-Write-1m: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-4k-32qd: (g=2): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4k-32qd: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.1
Starting 4 processes
3;fio-3.1;Seq-Read-1m;0;0;688128;68723;67;10013;56;493;80.492626;22.712829;2631;21488;14812.615244;4190.208675;1.000000%=2834;5.000000%=3162;10.000000%=4177;20.000000%=15925;30.000000%=16187;40.000000%=16187;50.000000%=16318;60.000000%=16318;70.000000%=16318;80.000000%=16449;90.000000%=16580;95.000000%=17170;99.000000%=19005;99.500000%=20840;99.900000%=21364;99.950000%=21364;99.990000%=21364;0%=0;0%=0;0%=0;2704;21549;14893.950371;4190.255731;47407;158024;78.560614%;53989.210526;25205.710417;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.000000%;0.689173%;673;0;288;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;9.67%;1.93%;87.65%;0.74%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39063;36599;0;0;365647;365329;731120;98.24%
3;fio-3.1;Seq-Write-1m;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;688128;68730;67;10012;55;171;108.481783;23.043303;2846;30348;14784.277686;4164.576428;1.000000%=3194;5.000000%=3522;10.000000%=3817;20.000000%=16056;30.000000%=16187;40.000000%=16187;50.000000%=16187;60.000000%=16318;70.000000%=16318;80.000000%=16318;90.000000%=16449;95.000000%=16449;99.000000%=17170;99.500000%=19267;99.900000%=30277;99.950000%=30277;99.990000%=30277;0%=0;0%=0;0%=0;2924;30447;14893.569182;4176.351137;45176;153600;75.075544%;51599.421053;24711.933877;0.039956%;0.829088%;672;0;27;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;10.71%;1.04%;87.80%;0.45%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39063;36599;0;0;365647;365329;731120;98.24%
3;fio-3.1;Rand-Read-4k-32qd;2;0;134748;13459;3364;10011;2;92;8.466012;2.590474;239;20816;9497.265206;2943.968638;1.000000%=561;5.000000%=782;10.000000%=5210;20.000000%=9895;30.000000%=10158;40.000000%=10289;50.000000%=10420;60.000000%=10420;70.000000%=10420;80.000000%=10551;90.000000%=10682;95.000000%=11599;99.000000%=13434;99.500000%=14090;99.900000%=15663;99.950000%=16908;99.990000%=19791;0%=0;0%=0;0%=0;248;20825;9506.346476;2944.622547;8572;29426;71.941295%;9682.578947;4781.092812;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.498501%;5.514486%;30815;0;62;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.53%;3.79%;3.77%;1.23%;0.59%;11.66%;78.40%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39063;36599;0;0;365647;365329;731120;98.24%
3;fio-3.1;Rand-Write-4k-32qd;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;125016;12487;3121;10011;2;90;9.628662;2.646959;636;20575;10235.473829;1366.904974;1.000000%=2965;5.000000%=9633;10.000000%=10289;20.000000%=10420;30.000000%=10420;40.000000%=10420;50.000000%=10420;60.000000%=10420;70.000000%=10420;80.000000%=10551;90.000000%=10551;95.000000%=10551;99.000000%=12648;99.500000%=13959;99.900000%=17170;99.950000%=18481;99.990000%=20054;0%=0;0%=0;0%=0;653;20584;10245.722438;1367.194715;12201;17311;100.000000%;12570.150000;1116.629245;1.758242%;5.004995%;30388;0;28;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.02%;0.11%;2.11%;3.04%;94.69%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39063;36599;0;0;365647;365329;731120;98.24%

Seq-Read-1m: (groupid=0, jobs=1): err= 0: pid=25409: Mon Apr 22 22:00:42 2019
   read: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10013msec)
    slat (usec): min=56, max=493, avg=80.49, stdev=22.71
    clat (usec): min=2631, max=21488, avg=14812.62, stdev=4190.21
     lat (usec): min=2704, max=21549, avg=14893.95, stdev=4190.26
    clat percentiles (usec):
     |  1.00th=[ 2835],  5.00th=[ 3163], 10.00th=[ 4178], 20.00th=[15926],
     | 30.00th=[16188], 40.00th=[16188], 50.00th=[16319], 60.00th=[16319],
     | 70.00th=[16319], 80.00th=[16450], 90.00th=[16581], 95.00th=[17171],
     | 99.00th=[19006], 99.50th=[20841], 99.90th=[21365], 99.95th=[21365],
     | 99.99th=[21365]
   bw (  KiB/s): min=47407, max=158024, per=78.56%, avg=53989.21, stdev=25205.71, samples=19
   iops        : min=   46, max=  154, avg=52.16, stdev=24.67, samples=19
  lat (msec)   : 4=9.67%, 10=1.93%, 20=87.65%, 50=0.74%
  cpu          : usr=0.00%, sys=0.69%, ctx=673, majf=0, minf=288
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=672,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq-Write-1m: (groupid=1, jobs=1): err= 0: pid=25410: Mon Apr 22 22:00:42 2019
  write: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10012msec)
    slat (usec): min=55, max=171, avg=108.48, stdev=23.04
    clat (usec): min=2846, max=30348, avg=14784.28, stdev=4164.58
     lat (usec): min=2924, max=30447, avg=14893.57, stdev=4176.35
    clat percentiles (usec):
     |  1.00th=[ 3195],  5.00th=[ 3523], 10.00th=[ 3818], 20.00th=[16057],
     | 30.00th=[16188], 40.00th=[16188], 50.00th=[16188], 60.00th=[16319],
     | 70.00th=[16319], 80.00th=[16319], 90.00th=[16450], 95.00th=[16450],
     | 99.00th=[17171], 99.50th=[19268], 99.90th=[30278], 99.95th=[30278],
     | 99.99th=[30278]
   bw (  KiB/s): min=45176, max=153600, per=75.08%, avg=51599.42, stdev=24711.93, samples=19
   iops        : min=   44, max=  150, avg=50.05, stdev=24.21, samples=19
  lat (msec)   : 4=10.71%, 10=1.04%, 20=87.80%, 50=0.45%
  cpu          : usr=0.04%, sys=0.83%, ctx=672, majf=0, minf=27
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,672,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4k-32qd: (groupid=2, jobs=1): err= 0: pid=25411: Mon Apr 22 22:00:42 2019
   read: IOPS=3364, BW=13.1MiB/s (13.8MB/s)(132MiB/10011msec)
    slat (nsec): min=2466, max=92755, avg=8466.01, stdev=2590.47
    clat (usec): min=239, max=20816, avg=9497.27, stdev=2943.97
     lat (usec): min=248, max=20825, avg=9506.35, stdev=2944.62
    clat percentiles (usec):
     |  1.00th=[  562],  5.00th=[  783], 10.00th=[ 5211], 20.00th=[ 9896],
     | 30.00th=[10159], 40.00th=[10290], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10552], 90.00th=[10683], 95.00th=[11600],
     | 99.00th=[13435], 99.50th=[14091], 99.90th=[15664], 99.95th=[16909],
     | 99.99th=[19792]
   bw (  KiB/s): min= 8572, max=29426, per=71.94%, avg=9682.58, stdev=4781.09, samples=19
   iops        : min= 2143, max= 7356, avg=2420.21, stdev=1195.26, samples=19
  lat (usec)   : 250=0.01%, 500=0.53%, 750=3.79%, 1000=3.77%
  lat (msec)   : 2=1.23%, 4=0.59%, 10=11.66%, 20=78.40%, 50=0.01%
  cpu          : usr=1.50%, sys=5.51%, ctx=30815, majf=0, minf=62
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=33687,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4k-32qd: (groupid=3, jobs=1): err= 0: pid=25412: Mon Apr 22 22:00:42 2019
  write: IOPS=3121, BW=12.2MiB/s (12.8MB/s)(122MiB/10011msec)
    slat (nsec): min=2932, max=90192, avg=9628.66, stdev=2646.96
    clat (usec): min=636, max=20575, avg=10235.47, stdev=1366.90
     lat (usec): min=653, max=20584, avg=10245.72, stdev=1367.19
    clat percentiles (usec):
     |  1.00th=[ 2966],  5.00th=[ 9634], 10.00th=[10290], 20.00th=[10421],
     | 30.00th=[10421], 40.00th=[10421], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10552], 90.00th=[10552], 95.00th=[10552],
     | 99.00th=[12649], 99.50th=[13960], 99.90th=[17171], 99.95th=[18482],
     | 99.99th=[20055]
   bw (  KiB/s): min=12201, max=17311, per=100.00%, avg=12570.15, stdev=1116.63, samples=20
   iops        : min= 3050, max= 4327, avg=3142.15, stdev=279.07, samples=20
  lat (usec)   : 750=0.01%, 1000=0.02%
  lat (msec)   : 2=0.11%, 4=2.11%, 10=3.04%, 20=94.69%, 50=0.01%
  cpu          : usr=1.76%, sys=5.00%, ctx=30388, majf=0, minf=28
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,31254,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10013-10013msec

Run status group 1 (all jobs):
  WRITE: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10012-10012msec

Run status group 2 (all jobs):
   READ: bw=13.1MiB/s (13.8MB/s), 13.1MiB/s-13.1MiB/s (13.8MB/s-13.8MB/s), io=132MiB (138MB), run=10011-10011msec

Run status group 3 (all jobs):
  WRITE: bw=12.2MiB/s (12.8MB/s), 12.2MiB/s-12.2MiB/s (12.8MB/s-12.8MB/s), io=122MiB (128MB), run=10011-10011msec

Disk stats (read/write):
  xvda: ios=39063/36599, merge=0/0, ticks=365647/365329, in_queue=731120, util=98.24%